In [4]:
import pandas as pd
import numpy as np

In [10]:
data={'name':['ankit','pankaj','shreya','vipin','priyanshi','mukul','abhishek'],
     'scores':[79,74,85,93,81,94,67],
     'age':[23,21,24,22,23,22,21],
     'course':['Btech','bca','bsc','Btech','bca','bca','msc']}
print(data)
print(type(data))

{'name': ['ankit', 'pankaj', 'shreya', 'vipin', 'priyanshi', 'mukul', 'abhishek'], 'scores': [79, 74, 85, 93, 81, 94, 67], 'age': [23, 21, 24, 22, 23, 22, 21], 'course': ['Btech', 'bca', 'bsc', 'Btech', 'bca', 'bca', 'msc']}
<class 'dict'>

In [13]:
df=pd.DataFrame(data)
df

        name  scores  age course
0      ankit      79   23  Btech
1     pankaj      74   21    bca
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca
5      mukul      94   22    bca
6   abhishek      67   21    msc

In [14]:
df.shape

(7, 4)

In [15]:
#viewing colummns
print(type(df.columns))
df.columns

<class 'pandas.core.indexes.base.Index'>

Index(['name', 'scores', 'age', 'course'], dtype='object')

In [75]:
df

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca
5   22      mukul    bca
6   21   abhishek    msc

In [16]:
#view data type of each col
df.dtypes

name      object
scores     int64
age        int64
course    object
dtype: object

In [17]:
# function to select rows

In [19]:
# 1 head

df.head()

        name  scores  age course
0      ankit      79   23  Btech
1     pankaj      74   21    bca
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca

In [20]:
df.head(3)

     name  scores  age course
0   ankit      79   23  Btech
1  pankaj      74   21    bca
2  shreya      85   24    bsc

In [22]:
#2 tail

df.tail()

        name  scores  age course
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca
5      mukul      94   22    bca
6   abhishek      67   21    msc

In [23]:
df.tail(3)

        name  scores  age course
4  priyanshi      81   23    bca
5      mukul      94   22    bca
6   abhishek      67   21    msc

In [26]:
#3 sample 
# returns random rows

df.sample()

    name  scores  age course
0  ankit      79   23  Btech

In [29]:
df.sample(4)

        name  scores  age course
3      vipin      93   22  Btech
2     shreya      85   24    bsc
5      mukul      94   22    bca
4  priyanshi      81   23    bca

In [32]:
df

        name  scores  age course
0      ankit      79   23  Btech
1     pankaj      74   21    bca
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca
5      mukul      94   22    bca
6   abhishek      67   21    msc

In [31]:
# function to describe dataframe
#1 describe()

df.describe()

          scores        age
count   7.000000   7.000000
mean   81.857143  22.285714
std     9.771192   1.112697
min    67.000000  21.000000
25%    76.500000  21.500000
50%    81.000000  22.000000
75%    89.000000  23.000000
max    94.000000  24.000000

In [33]:
#2 info()

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   scores  7 non-null      int64
 2   age     7 non-null      int64
 3   course  7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [34]:
# count related function
#1 count()
# count non null cells for each column or row

df.count()

name      7
scores    7
age       7
course    7
dtype: int64

In [35]:
df.count(axis=1)

0    4
1    4
2    4
3    4
4    4
5    4
6    4
dtype: int64

In [37]:
#2 value counts()

df['course'].value_counts()

bca      3
Btech    2
bsc      1
msc      1
Name: course, dtype: int64

In [38]:
# 3 unique()

df['course'].unique()

array(['Btech', 'bca', 'bsc', 'msc'], dtype=object)

In [39]:
# nunique()

df['course'].nunique()

4

In [ ]:
# manupulate dataframe

In [ ]:
# df.iloc

In [40]:
df

        name  scores  age course
0      ankit      79   23  Btech
1     pankaj      74   21    bca
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca
5      mukul      94   22    bca
6   abhishek      67   21    msc

In [42]:
df.iloc[2:4,:]

     name  scores  age course
2  shreya      85   24    bsc
3   vipin      93   22  Btech

In [43]:
df.iloc[:3,2:] # end row=3,start col=2

   age course
0   23  Btech
1   21    bca
2   24    bsc

In [46]:
df.iloc[:5,::2]# end row =5 step col=2 
# row num=0,1,2,3,4 col='name','age'

        name  age
0      ankit   23
1     pankaj   21
2     shreya   24
3      vipin   22
4  priyanshi   23

In [47]:
df.iloc[1::2,2:]# start row=1,step row=2,start col=2

   age course
1   21    bca
3   22  Btech
5   22    bca

In [48]:
# df.loc

df.loc[:4,:] # end row=4

        name  scores  age course
0      ankit      79   23  Btech
1     pankaj      74   21    bca
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca

In [49]:
df.loc[2:5,:]

        name  scores  age course
2     shreya      85   24    bsc
3      vipin      93   22  Btech
4  priyanshi      81   23    bca
5      mukul      94   22    bca

In [50]:
df.loc[1:5:2,:]

     name  scores  age course
1  pankaj      74   21    bca
3   vipin      93   22  Btech
5   mukul      94   22    bca

In [51]:
df.loc[2:6,['name','scores']]

        name  scores
2     shreya      85
3      vipin      93
4  priyanshi      81
5      mukul      94
6   abhishek      67

In [52]:
df.loc[2:6,['name','age','course']]

        name  age course
2     shreya   24    bsc
3      vipin   22  Btech
4  priyanshi   23    bca
5      mukul   22    bca
6   abhishek   21    msc

In [56]:
df.columns

Index(['name', 'scores', 'age', 'course'], dtype='object')

In [58]:
#df.iloc[:6:2,['name','course']]# error
df.iloc[:6:2,::3]

        name course
0      ankit  Btech
2     shreya    bsc
4  priyanshi    bca

In [61]:
#df.loc[3:5,1:3] error

df.loc[3:5,['name','scores','age']]

        name  scores  age
3      vipin      93   22
4  priyanshi      81   23
5      mukul      94   22

In [77]:
# select column from dataframe
 # select one col from dataframe

df.head()

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca

In [63]:
print(type(df['age']))
df['age']

<class 'pandas.core.series.Series'>

0    23
1    21
2    24
3    22
4    23
5    22
6    21
Name: age, dtype: int64

In [74]:
df.head()

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca

In [ ]:
# rename all column

In [76]:
df.head()

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca
5   22      mukul    bca
6   21   abhishek    msc

In [78]:
df.rename(columns={'age_in_2022':'age_ onjan2022','full_name':'firstname'},inplace=True)
df.head()

C:\Users\admin\AppData\Local\Temp\ipykernel_8060\14541163.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns={'age_in_2022':'age_ onjan2022','full_name':'firstname'},inplace=True)

   age       name course
0   23      ankit  Btech
1   21     pankaj    bca
2   24     shreya    bsc
3   22      vipin  Btech
4   23  priyanshi    bca